// Оператор - это встроенная функция в JS

// Операторы есть арифметические:

// + плюс, - минус, * умножение, / деление

// Операторы сравнения:

// === равно, !== не равно, <= меньше либо равно, >= больше либо равно

// Логические операторы:

// ! НЕ, && И, || ИЛИ

// Оператор присваивания:

// = присваивание 

// ----------------------------------------------------

// let a, b

// a = 10
// b = a

// let c = a + b

// console.log(c) // 20

// Еще раз оператор это втроенная функция 

// а = 10

// Ниже пример как выглядит встроенная функция равно (=)

// function = (переменная, выражение) {
//     1. Получение результата выражения
//     2. Поиск переменной по имени
//     3. Присваивание результата выражения переменной 
//     4. Возврат результата выражения
// }

// ----------------------------------------------------

// Операнды а = 10 слева и справа или же аргументы, ниже примеры

// Унарные операторы - у унарных операторов всегда один операнд (аргумент)

// a++ такой оператор увеличает значение переменной на единицу

// +a такой оператор конвентирует строку в число

// delete obj.a оператор удаления одного из свойст обьекта

// typeof a узнать тип переменной

// new Object() можно создать экземпляр обьекта 

// ----------------------------------------------------

// Бинарные операторы - у бинарных оператора два операнда (аргумента)

// a = 5 Оператор присваивания

// a + b оператор плюс

// a += 5 оператор увеличения и присваивания значения 

// a === b оператор сравнения 

// a && b оператор И

// ----------------------------------------------------

// Инфиксная запись, в таком формате оператор находится между операндами

// a = true

// a + b

// a += 5

// a || b

// a > b

// ----------------------------------------------------

// Префиксная запись, оператор стоит перед операндом

// ++a

// delete obj.a

// typeof a

// ----------------------------------------------------

// Постфиксная запись, это когда оператор идет за операндом

// a++

// myFunction()

// ----------------------------------------------------

// Логические операторы

// ! - НЕ (всегда возвращает значение типа boolean true или false)

// && - И

// || - ИЛИ

// ----------------------------------------------------

// Ложные значения в JS

// Boolean(value) -> false, 0, '', undefined, null (ложные значения выдают false)
